app/controllers/application_controller.rb

    def current_use
        if session[:use_id].present?
        @current_use ||= Use.find_by(id: session[:use_id])
---
SELECT  "uses".* FROM "uses" WHERE "uses"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]