app/controllers/ideas_controller.rb

    def create
        @idea = Idea.new ideas_params
        if @idea.save
---
INSERT INTO "ideas" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def show
        @review = Review.new
        @reviews = @idea.reviews.order(created_at: :desc)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."idea_id" = $1 ORDER BY "reviews"."created_at" DESC  [["idea_id", 152]]

    def index
        @ideas = Idea.order(created_at: :desc)
---
SELECT "ideas".* FROM "ideas" ORDER BY "ideas"."created_at" DESC

    def update
        if @idea.update(ideas_params)
---
UPDATE "ideas" SET "title" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["title", "Quantifying the sensor won't do anything, we need to reboot the auxiliary ftp panel!isso"], ["updated_at", "2018-07-16 20:54:59.548947"], ["id", 152]]

    def destroy
        @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 152]]

    def find_idea
        @idea = Idea.find params[:id]
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]