app/controllers/ideas_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_idea
        @idea = Idea.find params[:id]