app/controllers/reviews_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]
INSERT INTO "reviews" ("body", "idea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "luciana"], ["idea_id", 152], ["created_at", "2018-07-16 20:47:24.805738"], ["updated_at", "2018-07-16 20:47:24.805738"]]
---
    def create

        @idea = Idea.find params[:idea_id]
        @review = Review.new review_params
        @review.idea = @idea

        if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 269], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 269]]
---
    def destroy

        @review ||= Review.find params[:id]
        @review.destroy