app/controllers/sessions_controller.rb

SELECT  "uses".* FROM "uses" WHERE "uses"."email" = $1 LIMIT $2  [["email", "js@winterfell.gov"], ["LIMIT", 1]]
---
    def create
        use = Use.find_by(email: params[:session][:email])