app/controllers/uses_controller.rb

    def create
        @use = Use.new use_params

        if @use.save
---
INSERT INTO "uses" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"